# stored procedure

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import sqlite3 as sql

In [2]:
cnn=sql.connect('test.db')

In [3]:
%load_ext sql

In [4]:
%sql sqlite:///test.db

In [6]:
%%sql
select * from petsale

 * sqlite:///test.db
Done.

[(1, 'Cat', 450.09, '2018-05-29', 9),
 (2, 'Dog', 666.66, '2018-06-01', 3),
 (3, 'Parrot', 50, '2018-06-04', 2),
 (4, 'Hamster', 60.6, '2018-06-11', 6),
 (5, 'Goldfish', 48.48, '2018-06-14', 24)]

In [7]:
%%sql
DELIMITER //
END //
DELIMITER;

 * sqlite:///test.db
(sqlite3.OperationalError) near "DELIMITER": syntax error
[SQL: DELIMITER //
END //
DELIMITER;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

# log table

In [32]:
%%sql

CREATE TABLE IF NOT EXISTS sales_log (
    log_id INTEGER PRIMARY KEY,
    action TEXT,
    sale_id INTEGER,
    timestamp DATETIME DEFAULT CURRENT_TIMESTAMP
);

 * sqlite:///test.db
Done.

[]

# INSERT Trigger

In [34]:
%%sql
CREATE TRIGGER insert_sale_trigger
AFTER INSERT ON petsale
BEGIN
    INSERT INTO sales_log (action, sale_id) VALUES ('INSERT', NEW.ID);
END;

 * sqlite:///test.db
Done.

[]

# upate trigger

In [50]:
%%sql
 --drop trigger update_sale_trigger;
CREATE TRIGGER update_sale_trigger
AFTER UPDATE ON petsale
BEGIN
    INSERT INTO sales_log (action, sale_id) VALUES ('UPDATE', OLD.ID);
END;

 * sqlite:///test.db
Done.
Done.

[]

# Delete trigger

In [52]:
%%sql
create trigger delete_sale_trigger
after delete on petsale
begin 
    insert into sales_log (action, sale_id) values('DELETE',OLD.ID);
END;

 * sqlite:///test.db
Done.

[]

In [35]:
%%sql
insert into petsale values (6,'donkey',0,'2069-04-20',10)

 * sqlite:///test.db
1 rows affected.

[]

In [48]:
%%sql
update petsale set quantity=20 where pet='donkey'

 * sqlite:///test.db
4 rows affected.

[]

In [49]:
%%sql
select * from sales_log

 * sqlite:///test.db
Done.

[(1, 'INSERT', 6, '2024-04-22 17:04:58'),
 (2, 'UPDATE', 6, '2024-04-22 17:08:49'),
 (3, 'UPDATE', 6, '2024-04-22 17:08:49'),
 (4, 'UPDATE', 6, '2024-04-22 17:08:49'),
 (5, 'UPDATE', 6, '2024-04-22 17:08:49')]